---

<img src="../images/anchormen-logo.png" width="500">

---

# Basics Lab 3b: Data Munging with Pandas 

The two main data structures of Pandas are Series and DataFrames. We will first practice some simple data handling with each of these, before exploring some real world data.

This lab consists of the following sections:

- A: **Working with Series Objects**
- B: **Working with DataFrame Objects**
- C: **Exploring the Titanic Dataset**

Complete the exercises below. If you are having problems try to find a possible solution by looking at the pandas documentation: http://pandas.pydata.org/pandas-docs/stable/genindex.html


## Tips

- Press 'h' to show keyboard shortcuts in Jupyter Notebooks
- Use tab completion! When typing a command, press 'tab' to get a dropdown list of options
- Use the help() function to get help on a Python object

In [1]:
# Standard libraries
import pandas as pd 
import numpy as np

# Settings to display max number of columns/rows of pandas DataFrame
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', 20)

## A. Working with Series Objects

** Exercise**: Create a series with the following values: 4, 8, -3, 2

In [2]:
obj = pd.Series([4, 8, -3, 2])
obj

0    4
1    8
2   -3
3    2
dtype: int64

** Exercise: Create a Series object out of the following python dict**:
```
dict_data = {'Amsterdam': 35000, 'Utrecht': 71000, 'Den Haag': 16000, 'Maastricht': 5000} ```

In [3]:
dict_data = {'Amsterdam': 35000, 'Utrecht': 71000, 'Den Haag': 16000, 'Maastricht': 5000}
obj3 = pd.Series(dict_data)

## B. Working with DataFrame Objects

A DataFrame can be constructed from:

- a dict of lists of equal length, or
- a numpy array

** Exercise: Create a dataframe that corresponds to the image below: **

<img src="../images/df1.png" width="200">

In [4]:
df = pd.DataFrame(np.arange(50).reshape(10,5), columns=['zero', 'one', 'two', 'three', 'four'])
df

   zero  one  two  three  four
0     0    1    2      3     4
1     5    6    7      8     9
2    10   11   12     13    14
3    15   16   17     18    19
4    20   21   22     23    24
5    25   26   27     28    29
6    30   31   32     33    34
7    35   36   37     38    39
8    40   41   42     43    44
9    45   46   47     48    49

**Exercise: Swap the rows and columns of the DataFrame you just created **

In [5]:
df.transpose()

       0  1   2   3   4   5   6   7   8   9
zero   0  5  10  15  20  25  30  35  40  45
one    1  6  11  16  21  26  31  36  41  46
two    2  7  12  17  22  27  32  37  42  47
three  3  8  13  18  23  28  33  38  43  48
four   4  9  14  19  24  29  34  39  44  49


** Exercise: Create a DataFrame out of the python dict named dict_data **

In [6]:
dict_data = {'City': ['Amsterdam', 'Rotterdam', 'Den Haag', 'Utrecht'], 
             'Province': ['Noord-Holland', 'Zuid-Holland', 'Zuid-Holland', 'Utrecht'],
            'Residents': [838.338, 631.155, 520.704, 339.946]}

In [7]:
df = pd.DataFrame(dict_data)
df

        City       Province  Residents
0  Amsterdam  Noord-Holland    838.338
1  Rotterdam   Zuid-Holland    631.155
2   Den Haag   Zuid-Holland    520.704
3    Utrecht        Utrecht    339.946

**Exercise: Again create a DataFrame out of dict_data, now make sure the columns are in the following sequence: Province, Cities, Residents **

In [8]:
df2 = pd.DataFrame(dict_data, columns=['Province', 'City', 'Residents'])
df2

        Province       City  Residents
0  Noord-Holland  Amsterdam    838.338
1   Zuid-Holland  Rotterdam    631.155
2   Zuid-Holland   Den Haag    520.704
3        Utrecht    Utrecht    339.946

**Exercise: Create an additional column in the dataframe with the name 'year' and give it missing values**

In [9]:
df2['year'] = np.nan
df2

        Province       City  Residents  year
0  Noord-Holland  Amsterdam    838.338   NaN
1   Zuid-Holland  Rotterdam    631.155   NaN
2   Zuid-Holland   Den Haag    520.704   NaN
3        Utrecht    Utrecht    339.946   NaN

** Exercise: Retrieve the second index row from the dataframe**

In [10]:
df2.iloc[1]

Province     Zuid-Holland
City            Rotterdam
Residents         631.155
year                  NaN
Name: 1, dtype: object

** Exercise: Display all column names of the dataframe **

In [11]:
df2.columns

Index(['Province', 'City', 'Residents', 'year'], dtype='object')

**Exercise: select the Residents value for the city of Rotterdam **

In [12]:
df2.loc[df2.City=='Rotterdam', 'Residents']

1    631.155
Name: Residents, dtype: float64

**Exercise: Use the Series below to insert as values of the year column in the Dataframe. Pay special attention to how the values are inserted by looking at the output**

In [13]:
year_data = pd.Series([2007, 2008, 2009], index=[1,2,3])

df2['year'] = year_data

df2

        Province       City  Residents    year
0  Noord-Holland  Amsterdam    838.338     NaN
1   Zuid-Holland  Rotterdam    631.155  2007.0
2   Zuid-Holland   Den Haag    520.704  2008.0
3        Utrecht    Utrecht    339.946  2009.0

** Exercise: Change the index values of the DataFrame**

In [14]:
df2.index = ['k','i','h','j']
df2

        Province       City  Residents    year
k  Noord-Holland  Amsterdam    838.338     NaN
i   Zuid-Holland  Rotterdam    631.155  2007.0
h   Zuid-Holland   Den Haag    520.704  2008.0
j        Utrecht    Utrecht    339.946  2009.0

** Exercise: Use the `reindex` method to create a new Series object out of the obj below with indices reordered in alphabethic order, and an additional entry with index l with value 2**

In [15]:
# example series object
obj = pd.Series([4, 7, -5, 3], index=['k', 'i', 'h', 'j'])
obj

k    4
i    7
h   -5
j    3
dtype: int64

In [16]:
obj2 = obj.reindex(['h', 'i', 'j', 'k', 'l'], fill_value=2)
obj2

h   -5
i    7
j    3
k    4
l    2
dtype: int64

** Exercise: Create a new object out of the above object, which is the same but which does not contain the k-row**

In [17]:
obj3 = obj2.drop('k')
obj3

h   -5
i    7
j    3
l    2
dtype: int64

## C. Exploring the Titanic Dataset

** Exercise: import the titanic dataset as a pandas DataFrame. The dataset is located in the 'data' directory of this repository**

In [18]:
# import and look at the dataset
df_titanic = pd.read_csv('../data/titanic.csv')
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

** Exercise: Rename the first 3 column names to: P_Id, Surv, P_class **

In [19]:
df_titanic.rename(columns = {'PassengerId': 'P_Id', 'Survived': 'Surv', 'Pclass': 'P_class'}, inplace=True)
df_titanic

,P_Id,Surv,P_class,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [20]:
# NOT VALID ANY MORE
# df_titanic.ix[[35], :]

** Exercise: What is the age of the passenger with name: Holverson, Mr. Alexander Oskar **

In [21]:
df_titanic[df_titanic['Name']=='Holverson, Mr. Alexander Oskar']['Age']

35    42.0
Name: Age, dtype: float64

**Exercise: What are the names of the passengers who paid the highest fare? **

In [22]:
df_titanic[df_titanic['Fare'] == df_titanic['Fare'].max()]['Name']

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

**Exercise: Set the P_Id column as the index of the dataframe **

In [23]:
df_titanic.set_index(['P_Id'], inplace=True)
df_titanic.head()

,Surv,P_class,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
P_Id,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**Exercise: What is the average age **

In [24]:
df_titanic['Age'].mean()

29.69911764705882

**Exercise: What is the highest amount of fare?**

In [25]:
df_titanic['Fare'].max()

512.3292

**Exercise: What is the average amount of Fare paid by Female and Male? **

In [26]:
df_titanic.groupby('Sex').mean()['Fare']

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

**Exercise: How many unique cabins are in the dataset? **

In [27]:
df_titanic['Cabin'].nunique()

147

**Exercise: What are the top 5 most referred cabins? **

In [28]:
df_titanic['Age'].value_counts().head()

24.0    30
22.0    27
18.0    26
19.0    25
30.0    25
Name: Age, dtype: int64

**Is there a correlation between P_class (passenger class) and the amount of Fare paid? **

In [29]:
df_titanic[['P_class', 'Fare']].corr()

         P_class    Fare
P_class   1.0000 -0.5495
Fare     -0.5495  1.0000

**Exercise: Output the rows which corresponds to passengers who where in P_class 3 and paid a fare amount above 50.000 **

In [30]:
df_titanic[(df_titanic['P_class']==3) & (df_titanic['Fare']>50.000)]

,Surv,P_class,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
P_Id,,,,,,,,,,,
75,1,3,"Bing, Mr. Lee",male,32.0,0,0,1601,56.4958,NaN,S
160,0,3,"Sage, Master. Thomas Henry",male,NaN,8,2,CA. 2343,69.5500,NaN,S
170,0,3,"Ling, Mr. Lee",male,28.0,0,0,1601,56.4958,NaN,S
181,0,3,"Sage, Miss. Constance Gladys",female,NaN,8,2,CA. 2343,69.5500,NaN,S
202,0,3,"Sage, Mr. Frederick",male,NaN,8,2,CA. 2343,69.5500,NaN,S
325,0,3,"Sage, Mr. George John Jr",male,NaN,8,2,CA. 2343,69.5500,NaN,S
510,1,3,"Lang, Mr. Fang",male,26.0,0,0,1601,56.4958,NaN,S
644,1,3,"Foo, Mr. Choong",male,NaN,0,0,1601,56.4958,NaN,S
693,1,3,"Lam, Mr. Ali",male,NaN,0,0,1601,56.4958,NaN,S
793,0,3,"Sage, Miss. Stella Anna",female,NaN,8,2,CA. 2343,69.5500,NaN,S
827,0,3,"Lam, Mr. Len",male,NaN,0,0,1601,56.4958,NaN,S
839,1,3,"Chip, Mr. Chang",male,32.0,0,0,1601,56.4958,NaN,S
847,0,3,"Sage, Mr. Douglas Bullen",male,NaN,8,2,CA. 2343,69.5500,NaN,S
864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S

** Exercise: How many passengers have the last name 'Andersson' ? **

In [31]:
sum(df_titanic['Name'].apply(lambda x: x[:9]) == 'Andersson')

9